# AreaFilter Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaFilter Constructor
AreaFilter Class See Also
---
Constructs a filter which matches only areas.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AreaFilter()
```

# See Also
AreaFilter Class
Autodesk.Revit.DB Namespace